{
  "title": "Carney told Trump that Canada is not for sale. 'Never say never,' Trump replied",
  "authors": [
    "Lexie Schapitl Deepa Shivaram",
    "Lexie Schapitl",
    "Deepa Shivaram"
  ],
  "publish_date": "2025-05-06T00:00:00",
  "top_image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6552x3686+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F67%2F26%2Fa52a85f84573b8347aa45184b7d5%2Fgettyimages-2213172328.jpg",
  "text": "Carney told Trump that Canada is not for sale. 'Never say never,' Trump replied\n\ntoggle caption Jim Watson/AFP\n\nPresident Trump insisted that he would keep tariffs on Canadian goods during a friendly first meeting with Canadian Prime Minister Mark Carney at the White House on Tuesday, but he did not press his case that Canada should become the 51st state.\n\nTrump told reporters he would like to see Canada become part of the United States but nodded to the opposition to the idea from Canadians. \"Takes two to tango, right?\" Trump said.\n\nCarney, who won Canada's election last week by pushing back against Trump's aggression, told Trump that annexation was out of the question.\n\n\"As you know from real estate, there are some places that are never for sale. We're sitting in one right now,\" Carney told Trump. \"Having met with the owners of Canada over the course of the campaign, last several months, it's not for sale. Won't be for sale, ever,\" he said.\n\nTrump responded: \"Never say never.\"\n\nCanada is reeling from Trump's tariffs\n\nTrump's rhetoric and trade policies have sparked tension between the two allies and a wave of nationalism in Canada.\n\nSponsor Message\n\nTrump imposed a 25% tariff on many Canadian goods in March, including steel. On Tuesday, he said he was not inclined to lower tariffs on Canada, saying the tariffs would revitalize American manufacturing.\n\n\"We want to make our own cars,\" Trump said. \"We don't really want cars from Canada, and we put tariffs on cars from Canada, and at a certain point it won't make economic sense for Canada to build those cars. And we don't want steel from Canada because we're making our own steel.\"\n\nThe tariffs come ahead of a review of the United States-Mexico-Canada Agreement (USMCA) trade deal slated for next year. Carney said changes are needed in that agreement. \"Part of the way you conducted these tariffs has taken advantage of existing aspects of USMCA, so it's going to have to change,\" Carney said.\n\ntoggle caption Dominic Gwinn/AFP\n\nIt's the chance for a reset in the relationship\n\nCarney is a former central banker who took over after Prime Minister Justin Trudeau resigned as leader of the center-left Liberal Party in January. The party was down in the polls until Trump started talking about annexation, raising the ire of Canadians.\n\nTrump complimented Carney on his election win, wryly noting, \"I think I was probably the greatest thing that happened to him.\"\n\nCarney's willingness to stand up to Trump's rhetoric was a big part of his appeal to voters, said Asa McKercher, a public policy professor at St. Francis Xavier University in Nova Scotia, describing the \"elbows up\" slogan adopted by Carney's campaign. It's a hockey term used to describe a defensive stance.\n\nTuesday's meeting could be an opportunity to \"reset the relationship\" between the U.S. and Canada, \"because it's pretty bad,\" McKercher said ahead of the meeting. \"Canadians are really upset at the president of the United States.\"",
  "url": "https://www.npr.org/2025/05/06/nx-s1-5387465/trump-carney-canada-tariffs"
}