{
  "title": "GOP-led states are passing new restrictions for voters to get issues on the ballot",
  "authors": [
    "Ashley Lopez"
  ],
  "publish_date": "2025-05-08T00:00:00",
  "text": "GOP-led states are passing new restrictions for voters to get issues on the ballot\n\ntoggle caption Andrew DeMillo/AP\n\nMark Johnson, a Republican state senator in Arkansas, was attending a festival in his district last year when he came across people gathering signatures for a proposed ballot measure that would protect abortion rights in the state.\n\n\"They said this was about women's health,\" he recalled. \"And I said, 'Oh, really?' … They didn't make clear what it was. I knew exactly what it was because I had read it very carefully.\"\n\nThe abortion measure ultimately didn't make the ballot, but this year, Johnson and others in the state's Republican-led legislature passed a bill requiring that the title of a proposed ballot measure be read in full and out loud by either the petition-signer or the signature-gatherer.\n\nSponsor Message\n\nThe bill was one of several passed in Arkansas creating new rules for efforts to get measures on the state ballot. The rules also require petition-signers to show a photo ID and confirm that they know fraud is a crime. And if they sign without doing any of this, the person collecting signatures could be charged with a crime.\n\nTwo dozen states allow citizens to propose ballot measures, and Republican lawmakers in Arkansas and other states are now passing new restrictions that they say will combat fraud in the process.\n\nBut opponents say these laws strip voters of a realistic way to address issues that their lawmakers won't address.\n\n\"It's really a problem, you know, in terms of time, ability to recruit folks to be canvassers, getting folks to sign petitions, getting as many people as you can to sign,\" said Bonnie Miller, president of the League of Women Voters of Arkansas. \"This is one of the biggest, the most egregious, laws that they passed.\"\n\nMiller's group is suing state election officials over the ballot title-reading requirements, which they say are unconstitutional. She said her group is worried they will create \"a chilling effect.\"\n\n\"Because who is going to go canvass with these rules?\" she said. \"And then it has a chilling effect on the folks who are willing to sign these petitions, because who wants to stand around and listen to that? And also, it's very possible that you may be talking to somebody who has already read the ballot title on their own at home or is very familiar with the subject.\"\n\nMiller said she thinks Republicans are afraid that an effort to put a pro-abortion rights measure on the ballot could come back, since advocates got very close last time.\n\nJohnson, however, said this is not about preventing voters from getting measures on the ballot.\n\n\"We don't want to take away their rights, but we want to protect them from special interests that will abuse the process and confuse them,\" he said.\n\nKelly Hall — the executive director of the Fairness Project, a group that works to pass economic and social justice policies through ballot measures — said she's seen more state bills to limit citizen-initiated ballot measures this year than ever before.\n\nSponsor Message\n\n\"This is an absolute high watermark for the number of attacks on citizen-initiated ballot measures that we've ever seen,\" she said. \"It doesn't mean it's brand new this year, but it is in much more full force, and that's showing up in a few different ways.\"\n\nWhile states like Arkansas are creating new restrictions for groups that gather signatures, Hall points out that others are trying to increase the threshold for a measure to pass, to 60%.\n\nFlorida already has this higher threshold. Last year a clear majority of Florida voters — 57% — supported a measure protecting abortions in the state, but it didn't pass because of this threshold.\n\n\"It's already really difficult to even get a measure on the ballot and then it's difficult to pass it once it's on the ballot,\" said Letitia Harmon, director of policy and research for a social justice advocacy group called Florida Rising. \"And yet they have made attacks on ballot initiatives, the governor has made attacks on ballot initiatives, one of his highest policy priorities.\"\n\ntoggle caption Lynne Sladky/AP\n\nLast week, Florida Gov. Ron DeSantis signed House Bill 1205 that he said will \"combat petition fraud and prevent the special interest-abuse of our constitutional amendment process.\" It's already drawn a legal challenge.\n\nThe bill requires people to show ID before signing a petition, like the law Arkansas just enacted. It also prohibits people from gathering more than 25 signatures beyond their own and those belonging to their immediate family. If a person collects more than that number, they could face criminal penalties.\n\nLike DeSantis, Florida Republican state Sen. Jennifer Bradley said the measure's purpose is to combat fraud.\n\n\"This is not a bill to restrict,\" Bradley said during debate over the legislation. \"It is a bill to protect to make sure that our constitutional system is one of integrity and that it's free of fraud.\"\n\nSponsor Message\n\nFraud among signature-gatherers is not a new or isolated problem in elections. Many of the issues, experts have said, are among paid gatherers; some states also allow gatherers to be paid per signature and not by the hour, which experts say contributes to higher rates of fraud.\n\nBut advocates say there are ways to address fraud without making it harder for voters to get issues on the ballot.\n\n\"There are already laws and provisions in place that make fraud a crime,\" Harmon said.\n\nState officials who investigate and prosecute election crimes in Florida have been arresting paid signature-gatherers in recent years. They asked legislators to make the rules tougher, though.\n\nHarmon said many of the claims of fraud that leaders in Florida have pointed to are typical human error that now will be criminally penalized.\n\nThe Fairness Project's Hall says she sees these laws as a broader failing of the relationship between representatives and their voters.\n\n\"Direct democracy should be an opportunity for voters to speak to their politicians,\" she said. \"'This is really what we want. You should listen to us.' … And instead, not only are we not taking up these issues, we're going to make it harder for our voters to take them up themselves.\"",
  "url": "https://www.npr.org/2025/05/08/nx-s1-5382445/direct-democracy-ballot-measure-laws"
}