{
  "title": "Economists warn Trump's research cuts could have dire consequences for GDP",
  "authors": [
    "Geoff Brumfiel"
  ],
  "publish_date": "2025-05-08T00:00:00",
  "text": "Economists warn Trump's research cuts could have dire consequences for GDP\n\ntoggle caption AP/Roscosmos Space Agency Press Service\n\nWhen Casey Dreier saw President Trump's proposed budget for NASA, he couldn't believe the numbers.\n\n\"This is the worst NASA budget I've seen in my lifetime,\" says Dreier, the chief of space policy for the Planetary Society, a nonprofit that advocates for space exploration.\n\nThe budget proposes deep cuts for NASA's Science Mission Directorate, which oversees everything from telescopes peering deep into space to robotic probes exploring planets like Mars. Many of these projects cost billions of dollars to build and launch, but the budget cuts are so deep \"that it will require NASA to turn off active spacecraft that are producing good science for pennies on the dollar for what the U.S. taxpayer paid for them,\" Dreier says.\n\nSponsor Message\n\nIt's not just spacecraft — Trump's proposed budget for the federal government would switch off huge swaths of America's scientific enterprise. The National Science Foundation (NSF) would be slashed in half. The National Institutes of Health would lose $17 billion in funding. Other agencies like the Energy Department, the U.S. Geological Survey and the National Oceanic and Atmospheric Administration would all see deep cuts totaling billions of dollars.\n\nThese proposals \"would be catastrophic if they were implemented,\" says Sudip Parikh, the CEO of the American Association for the Advancement of Science. If the Republican-controlled Congress follows Trump's budget outline, Parikh warns, it will slash science at every university and laboratory in the United States.\n\n\"It hollows out science across the country, not just in the places that I know the administration sometimes likes to single out, but across the entire country,\" he says.\n\ntoggle caption Patrick Cullis/AP/NOAA\n\nLong-term losses\n\nSo far, much of the focus of Trump's economic policy has been on tariffs. The president has said that they could raise the prices of some items, causing short-term pain.\n\nBut some economists warn that his dismal budget for research, unveiled last week as part of a larger plan, also carries long-term risks.\n\nThat's because fundamental science underpins America's economic growth, according to Andrew Fieldhouse, an economist at Texas A&M University who studies R&D's effect on the economy.\n\nSponsor Message\n\n\"In dollar terms, the economic returns are really, really high,\" he says. Since World War II, \"government R&D investments are pretty consistently driving about 20 to 25 percent of all U.S. private-sector productivity growth.\"\n\nConsider NSF grant 8107494. It was given to a scientist named John J. Hopfield in 1981 for the theoretical study of biological molecules and processes. The grant was worth just under $300,000 back then (a hair beneath a million dollars today), and it funded Hopfield's work on an obscure topic: artificial neural networks. That science now underpins the multibillion-dollar AI revolution powering the tech economy. It also won Hopfield a Nobel Prize in physics last year.\n\nSome economists believe the private sector could have done the same thing. Richard Stern, who directs economic and budget policy studies at the conservative Heritage Foundation, believes that industry should be funding most of the basic research in the United States.\n\n\"I think getting the federal money out of this — making these labs sing for their supper and get money from private entities that want to research things that are practical for people — I think is the better way to stimulate growth by far,\" he says.\n\nHowever, even Stern says these cuts to scientific research wouldn't be a priority for him.\n\n\"If I was rank-ordering government spending to get rid of, this would not be at the top of the list,\" he says.\n\nAnd many other economists say industry can never replace the government as a funder of basic research.\n\n\"Very often, the private sector ends up underinvesting in these fundamental basic research areas,\" says Vasudeva Ramaswamy, an economist at American University.\n\nThe knowledge generated is too general, and the economic payoff too distant, he says.\n\nThe president's proposed cuts are just that — proposals. It's Congress that actually sets the budget. But if lawmakers choose to follow Trump's budget outline, Ramaswamy projects that America's future gross domestic product could be more than 4% smaller as a result of these cuts. That's roughly the size of the contraction experienced during the Great Recession, which lasted from December 2007 to June 2009 and was the country's longest recession since World War II.\n\nSponsor Message\n\nUltimately, he says, these cuts could end up costing the government itself a lot of money.\n\n\"The economy tomorrow is going to be smaller because you decided to cut that funding today,\" he says. \"And if your economy tomorrow is smaller, you're going to be raising less in taxes.\"",
  "url": "https://www.npr.org/2025/05/08/nx-s1-5383918/economists-trump-research-science-cuts-gdp-recession"
}