{
  "title": "Trump pulls controversial pick for U.S. Attorney for D.C.",
  "authors": [
    "Tom Dreisbach"
  ],
  "publish_date": "2025-05-08T00:00:00",
  "text": "Trump pulls controversial pick for U.S. Attorney for D.C.\n\ntoggle caption Amanda Andrade-Rhoades/AP\n\nPresident Trump announced he will withdraw his nomination for U.S. Attorney for Washington, D.C., following unified opposition from Senate Democrats and pushback from some key Republicans.\n\nEd Martin, a longtime Republican activist with no previous prosecutorial experience, had been serving as the interim U.S. Attorney in the nation's capital since Trump's inauguration.\n\nTrump said he was \"very disappointed\" by the Senate's response, but promised to name a new nominee soon.\n\n\"We have somebody else that will be great,\" Trump said.\n\nMartin's nomination ultimately collapsed under the weight of multiple controversies.\n\nAmong them: Martin's outspoken advocacy for defendants charged in the Jan. 6, 2021 attack on the U.S. Capitol; his past praise for an alleged \" Nazi sympathizer \"; and a series of letters he sent to medical journals , Wikipedia's leadership and members of Congress , which many interpreted as threats.\n\nSponsor Message\n\nAs interim U.S. Attorney, Martin directed the firing of prosecutors who had worked on Jan. 6 cases, launched an internal investigation into their conduct, and ordered the dismissal of ongoing Capitol riot probes.\n\nBefore his appointment, Martin promoted conspiracy theories about the Jan. 6 attack, including the claim that federal agents instigated the violence.\n\n\"The more we find out about how staged and managed this was,\" Martin said in a 2024 podcast interview , \"the more we have to have less judgment for somebody who hits a cop.\"\n\nSen. Thom Tillis, a North Carolina Republican on the Senate Judiciary Committee, said he could not support Martin's confirmation because of his views on Jan. 6.\n\n\"We have to be very, very clear that what happened on Jan. 6 was wrong. It was not prompted or created by other people to put those people in trouble. They made a stupid decision, and they disgraced the United States by absolutely destroying the Capitol,\" Tillis told reporters earlier this week..\n\n\"If Mr. Martin were being put forth as a U.S. Attorney for any district, except the district where Jan. 6 happened,\" Tillis said, \"I'd probably support him. But not in this district.\"\n\nThe U.S. Attorney's office in Washington, D.C., along with its counterpart in Manhattan, is widely considered among the most important federal law enforcement roles in the country.\n\n\"Sen. Tillis' pushback on Martin's views on Jan. 6 was very important,\" said Carl Tobias, a law professor at the University of Richmond, in an email. \"Martin lacked much relevant experience for the second most important U.S. Attorney office in the U.S., and his performance as the interim U.S. Attorney did not inspire much confidence that he should be confirmed.\"\n\nSponsor Message\n\n\"This is a great day for anyone who cares about a fair and functional justice system,\" said Brendan Ballou, a former federal prosecutor who worked on Jan. 6 cases and left the office shortly after Martin's arrival. \"Ed Martin came to this job with no prosecutorial experience, and spent his time threatening perceived political opponents.\"\n\nMartin's supporters expressed disappointment over the failed nomination.\n\n\"Ed Martin is a very good man and close friend of mine,\" Mike Davis, a prominent right-wing attorney, posted on social media . \"These Republicans are not willing to fight like Democrats, who confirmed countless radical nominees for Joe Biden.\"\n\nTrump told reporters that he had limited political capital to spend on Martin's troubled nomination, given his other priorities.\n\n\"I have so many different things that I'm doing now with the trade. You know, I'm one person,\" Trump said. \"I can only lift that little phone so many times in a day.\"\n\nTrump said he would likely find another role for Martin in his administration, presumably one that does not require Senate confirmation.",
  "url": "https://www.npr.org/2025/05/08/nx-s1-5391840/trump-ed-martin-withdraws-nomination-prosecutor"
}