{
  "title": "Trump announces trade deal with the U.K., first since his tariffs sent markets reeling",
  "authors": [
    "Danielle Kurtzleben",
    "Tamara Keith Fatima Al-Kassab",
    "Tamara Keith",
    "Fatima Al-Kassab"
  ],
  "publish_date": "2025-05-07T00:00:00",
  "text": "Trump announces trade deal with the U.K., first since his tariffs sent markets reeling\n\ntoggle caption Jim Watson/AFP\n\nWASHINGTON, D.C., and LONDON — President Trump and British Prime Minister Keir Starmer on Thursday announced they had reached a trade agreement that lifted some — but not all — U.S. tariffs on British goods.\n\nIt's Trump's first such deal since his steep tariffs last month roiled stock markets and raised fears about a U.S. recession. Trump made the announcement sitting at the Resolute Desk in the Oval Office, with Starmer joining by speakerphone.\n\nTrump said it would give U.S. companies better market access for beef, ethanol, other farm products, chemicals, machinery and industrial products — new opportunities his administration said were worth $5 billion. But talks on non-tariff barriers to U.S. meat still needed to continue, Trump officials said.\n\n\"The final details are being written up in the coming weeks,\" Trump said. \"We think just about everything's been approved.\"\n\nThe 10% U.S. tariff on imports of most British goods will remain.\n\nThe deal lifts U.S. tariffs on British steel and aluminum\n\nStarmer, speaking to reporters from at a Jaguar Land Rover car factory in the British Midlands, said the deal would protect British businesses and save jobs.\n\nSponsor Message\n\nHe said the deals removes 25% tariffs on British steel and aluminum, and cuts U.S. tariffs from 27.5% to 10% for almost all cars exported from the United Kingdom. (Last year, 101,000 British cars were imported into the United States; under this deal, the 10% tariff would apply only to the first 100,000 cars.)\n\ntoggle caption Alberto Pezzali/Pool/AFP\n\nThe U.K. prime minister said all of these tariff cuts would come into effect \"as soon as possible.\"\n\n\"We are the first country to secure such a deal with the United States, and in an era of global insecurity and instability, that is so important,\" Starmer said in a speech on the factory floor, with dozens of workers in overalls behind him.\n\nFor Britain, Thursday's agreement is part of an effort to strike new post-Brexit trade deals. Since leaving the European Union five years ago, it's been negotiating new trade rules with individual countries, and signed a comprehensive deal with India earlier this week.\n\nCommerce Secretary Howard Lutnick said the United States will allow tariff-free imports of Rolls Royce engines and plane parts, noting that there would be an announcement later on Thursday of $10 billion in purchases of Boeing planes.\n\nTrump says it's the first deal of many\n\nTrump's administration has engaged in a flurry of talks with trading partners since April 2, when Trump rolled out a 10% tariff on all imported goods, as well as what he called \"reciprocal tariffs\" — steep tariff walls aimed at punishing countries for their trading practices and volumes, and at drawing manufacturing to America.\n\nSponsor Message\n\nTrump retreated from his country-specific tariffs after markets plunged last month, pausing the hikes for 90 days, though he kept the 10% baseline in place, as well as those on autos, steel and aluminum — and extremely steep tariffs on China, where 145% tariffs have effectively stopped shipments. Economists have warned that the tariffs could lead to shortages of some goods and raise consumer prices for others.\n\nTrump administration officials have said his moves brought countries to the table to talk about a range of trade issues, including Japan, South Korea, the United Kingdom, Vietnam and India. On Saturday, Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer are set to meet China's He Lifeng in Switzerland.\n\nAsked what the U.K. would need to do to lift the 10% baseline tariff, Trump said it was \"set\" and indicated it was unlikely to change.\n\nHe said that other trade partners should not necessarily expect to be left with such a low tariff after their negotiations.\n\n\"That's a low number. They made a good deal. Many, some will be much higher, because they have massive trade surpluses,\" Trump said.",
  "url": "https://www.npr.org/2025/05/07/nx-s1-5389973/trump-trade-deal-uk-tariffs"
}